Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеОтчетыИОбработки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьДоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВариантыПубликацииДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыПубликацииДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РежимОтладки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДополнительныеОтчетыИОбработки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Асинх Процедура РДО_ПубликацияПриИзмененииПосле(Элемент)
	Если Объект.Публикация = ПредопределенноеЗначение("Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.РежимОтладки") Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Заголовок = "Укажите каталог для сохранения файла отладки"; 
		Диалог.МножественныйВыбор = Ложь;
		Ответ = Ждать Диалог.ВыбратьАсинх();
		Если Ответ <> Неопределено Тогда
			Объект.ПутьДоФайла = Ответ[0];
			Адрес = ДополнительныеОтчетыИОбработкиВызовСервера.ПоместитьВХранилище(Объект.Ссылка, УникальныйИдентификатор);
			ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
			ПараметрыСохранения.Интерактивно = Ложь;
			ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, Адрес, Объект.ПутьДоФайла + "\" + Объект.ИмяФайла, ПараметрыСохранения);
		КонецЕсли;
	Иначе                    
		ТекстВопроса = "Обновить обработку из файла отладки?";
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 20, КодВозвратаДиалога.Да, "Внимание!", КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.ИмяФайла = Объект.ПутьДоФайла + "\" + Объект.ИмяФайла;
			ПараметрыРегистрации = Новый Структура;
			ПараметрыРегистрации.Вставить("Успех", Ложь);
			ПараметрыРегистрации.Вставить("АдресДанныхОбработки", АдресДанныхОбработки);
			Обработчик = Новый ОписаниеОповещения("ОбновитьИзФайлаПослеВыбораФайла", ЭтотОбъект, ПараметрыРегистрации);
			ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
			ПараметрыЗагрузки.Интерактивно = Ложь;
			ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
			ФайловаяСистемаКлиент.ЗагрузитьФайл(Обработчик, ПараметрыЗагрузки, Объект.ИмяФайла);
		КонецЕсли;
		Объект.ПутьДоФайла = "";	
	КонецЕсли;
КонецПроцедуры
